{"responseData": {"feed":{"feedUrl":"http://blog.nj.com/middlesex_impact/rss.xml","title":"Middlesex County","link":"","author":"","description":"","type":"rss20","entries":[{"title":"Laundry fire displaces South Brunswick family","link":"http://www.nj.com/middlesex/index.ssf/2015/11/laundry_fire_displaces_south_brunswick_family.html","author":"\u0026lt;span class\u003d\u0026quot;author vcard\u0026quot;\u0026gt;\u0026lt;a class\u003d\u0026quot;bl\u0026quot; id\u003d\u0026quot;name_author\u0026quot; href\u003d\u0026quot;http://connect.nj.com/staff/mylesdma/posts.html\u0026quot;\u0026gt;\n\t\n\t\t\n\t\n\t\n\t\n\t\n\tMyles Ma | NJ Advance Media for NJ.com\n\u0026lt;/a\u0026gt;\u0026lt;/span\u0026gt;","publishedDate":"Sun, 08 Nov 2015 11:00:50 -0800","contentSnippet":"\n\t\t\t\t\t\t\tA fire displaced a Kendall Park family Saturday, police said.\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\tKendall Park firefighters ...","content":"\u003cp\u003e\n\t\t\t\t\t\t\tA fire displaced a Kendall Park family Saturday, police said.\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\t\u003cdiv\u003e\u003cspan\u003e\u003ca href\u003d\"http://media.nj.com/middlesex_impact/photo/south-brunswick-fire-1108jpg-c7e975589ec89a99.jpg\"\u003e\u003cimg src\u003d\"/static/common/img/blank.gif\" alt\u003d\"south-brunswick-fire-1108.jpg\"\u003e\u003c/a\u003e\u003cspan\u003e\u003cspan\u003eKendall Park firefighters responded to a blaze on Stockton Road, Nov. 8, 2015. (South Brunswick Police)\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e \u003c/div\u003e\n\u003cp\u003e\u003ca href\u003d\"http://nj.com/middlesex\"\u003eSOUTH BRUNSWICK\u003c/a\u003e -- A fire displaced a Kendall Park family Saturday, police said.\u003c/p\u003e\n\u003cp\u003eThe homeowner called 911 at 5 p.m. to report a fire in the laundry room of his Stockton Road home, South Brunswick police said.\u003c/p\u003e\n\u003cp\u003eThe family evacuated safely, police said. The Kendall Park Fire Department contained the fire to the laundry and kitchen, but the house took heavy smoke damage.\u003c/p\u003e\n\u003cp\u003eThe family is staying with friends in the area. The South Brunswick Fire Marshall is investigating the blaze, but it appears accidental, police said.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eMyles Ma may be reached at \u003ca href\u003d\"mailto:mma@njadvancemedia.com\"\u003emma@njadvancemedia.com\u003c/a\u003e. Follow him on Twitter \u003ca href\u003d\"http://twitter.com/MylesMaNJ\"\u003e@MylesMaNJ\u003c/a\u003e. Find \u003ca href\u003d\"https://www.facebook.com/NJ.com\"\u003eNJ.com on Facebook\u003c/a\u003e.\u003c/em\u003e\u003c/p\u003e\n\u003cdiv\u003e\u003cspan title\u003d\"slideshow\"\u003e\u003cimg src\u003d\"http://media.nj.com/njcom_photos/photo/2015/10/20/19014203-large.jpg\" alt\u003d\"Gallery preview\" border\u003d\"1\" height\u003d\"219\" width\u003d\"380\"\u003e\u003c/span\u003e\u003c/div\u003e","categories":["@news","south-brunswick","is-featured"]},{"title":"This dog was rescued from the cold waters of the Arthur Kill","link":"http://www.nj.com/middlesex/index.ssf/2016/03/this_dog_may_have_9_lives.html","author":"\u0026lt;span class\u003d\u0026quot;author vcard\u0026quot;\u0026gt;\u0026lt;a class\u003d\u0026quot;bl\u0026quot; id\u003d\u0026quot;name_author\u0026quot; href\u003d\u0026quot;http://connect.nj.com/user/sepstein/posts.html\u0026quot;\u0026gt;\n\t\n\t\t\n\t\n\t\n\t\n\t\n\tSue Epstein | NJ Advance Media for NJ.com\n\u0026lt;/a\u0026gt;\u0026lt;/span\u0026gt;","publishedDate":"Tue, 01 Mar 2016 14:59:40 -0800","contentSnippet":"\n\t\t\t\t\t\t\tA dog and the animal control officer who saved him survived the cold waters off Woodbridge without ...","content":"\u003cp\u003e\n\t\t\t\t\t\t\tA dog and the animal control officer who saved him survived the cold waters off Woodbridge without injury.\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\t\u003cp\u003e\u003ca href\u003d\"javascript:void(0);\"\u003eWOODBRIDGE\u003c/a\u003e -- Austin Clyburn has a special bond with a Corgi-mix that now calls the Woodbridge Animal Shelter home--he saved the animal from the cold waters of the Arthur Kill Monday morning.\u003c/p\u003e\n\u003cp\u003eClyburn and Sue Schaefer, both animal control officers for the township, were called to Alvin Williams Park in Sewaren shortly before 9 a.m. Monday by a 9-1-1 call about a dog running at large in the park.\u003c/p\u003e\n\u003cp\u003eHeather Campione, the township's supervisor of animal control, said the caller reported the dog had a collar and a leash.\u003c/p\u003e\n\u003cp\u003eShe said a good Samaritan attempted to catch the dog, but was unable to.\u003c/p\u003e\n\u003cp\u003eBy the time Clyburn and Schaefer arrived, the dog had run into a marshy, high-brush area near the marina. They searched the brush, along with Woodbridge police Officer Stephanie Anderson, who is also an animal control officer. They found the dog, who by then had made his way into the cold Arthur Kill.\u003c/p\u003e\n\u003cp\u003e\"The officers attempted to call the dog out,\" Campione said. \"The dog initially swam towards them, but abruptly turned around and began to swim further out.\"\u003c/p\u003e\n\u003cp\u003eThen the dog began to lose strength and flipped over, Campione said.\u003c/p\u003e\n\u003cp\u003eClyburn jumped into action, and into the water.\u003c/p\u003e\n\u003cp\u003e\"As soon as I saw it flip, I had to go in,\" Clyburn said. \"I knew it was going to die.\"\u003c/p\u003e\n\u003cp\u003eHe managed to grab the dog and swim him back to shore, where they both spent time in hospitals--Clyburn at JFK Medical Center in Edison and the dog at the Woodbridge Veterinary Group.\u003c/p\u003e\n\u003cp\u003e\"They both spent the same amount of time there--six hours,\" Campione laughed. \"They were released at the same time and came back here.\"\u003c/p\u003e\n\u003cp\u003e\u003ca href\u003d\"http://www.nj.com/middlesex/index.ssf/2016/03/nj_pet_store_owner_charged_with_267_counts_of_animal_cruelty.html\"\u003ehttp://www.nj.com/middlesex/index.ssf/2016/03/nj_pet_store_owner_charged_with_267_counts_of_animal_cruelty.html\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eShe said there is no way of tracing an owner since the dog had no license or identifying chip.\u003c/p\u003e\n\u003cp\u003eCampione said the dog \"is very sweet, a Mr. Potato Head kind of dog, very calm.\"\u003c/p\u003e\n\u003cp\u003eThe veterinarians said the dogis about eight years old.\u003c/p\u003e\n\u003cp\u003eCampione said the shelter must wait seven days to see if the owner steps forward.\u003c/p\u003e\n\u003cp\u003eIf the owner doesn't come forward, after the seven day waiting period, he will be neutered and have a chip placed under it's skin for identification purposes. Then the dog will be placed up for adoption.\u003c/p\u003e\n\u003cp\u003eCampione said she doesn\u0026#39;t know why the dog was out there, but she said the township dog park is there and \u0026quot;we do get many unwanted dogs tied up out there by the park. Many times they just stay there until they are found.  Others get free and run around.\u0026quot;\u003c/p\u003e\n\u003cp\u003eThe Woodbridge Animal Shelter and Pet Adoption Center is at 195 Woodbridge Avenue in Sewaren. The phone number is (732) 855-0600 x5007\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eSue Epstein may be reached at \u003ca href\u003d\"mailto:sepstein@njadvancemedia.com\"\u003esepstein@njadvancemedia.com\u003c/a\u003e. Follow her on Twitter \u003ca href\u003d\"http://www.twitter.com/susan_epstein\"\u003e@susan_epstein\u003c/a\u003e. Find \u003ca href\u003d\"https://www.facebook.com/NJ.com\"\u003eNJ.com on Facebook\u003c/a\u003e.\u003c/em\u003e\u003c/p\u003e","categories":["@news","@river","woodbridge"]},{"title":"State lifts drought watch for 12 counties after soggy, snowy winter","link":"http://www.nj.com/weather/index.ssf/2016/03/state_lifts_drought_watch_for_12_counties_after_so.html","author":"\u0026lt;span class\u003d\u0026quot;author vcard\u0026quot;\u0026gt;\u0026lt;a class\u003d\u0026quot;bl\u0026quot; id\u003d\u0026quot;name_author\u0026quot; href\u003d\u0026quot;http://connect.nj.com/staff/sstirling/posts.html\u0026quot;\u0026gt;\n\t\n\t\t\n\t\n\t\n\t\n\t\n\tStephen Stirling | NJ Advance Media for NJ.com\n\u0026lt;/a\u0026gt;\u0026lt;/span\u0026gt;","publishedDate":"Tue, 01 Mar 2016 13:34:28 -0800","contentSnippet":"\n\t\t\t\t\t\t\tWater concerns disappear after repeated rain and snow events pull reservoirs back to normal. \n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\tWatch ...","content":"\u003cp\u003e\n\t\t\t\t\t\t\tWater concerns disappear after repeated rain and snow events pull reservoirs back to normal. \n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\u003cspan\u003e\u003ca href\u003d\"http://www.nj.com/weather/index.ssf/2016/03/state_lifts_drought_watch_for_12_counties_after_so.html\"\u003eWatch video\u003c/a\u003e\u003c/span\u003e\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\t\u003cp\u003eA drought watch that \u003ca href\u003d\"http://www.nj.com/weather/index.ssf/2015/09/drought_watch_issued_in_12_counties_as_nj_water_worries_worsen.html\"\u003ehas been in effect since September\u003c/a\u003e in 12 New Jersey counties was lifted today as regular snow and rain events eliminated significant precipitation shortfalls after a dry summer.  \u003c/p\u003e\n\u003cp\u003eThe state Department of Environmental Protection lifted the drought watch after reservoir, ground water, streamflow and precipitation levels returned to normal this winter after fears that the state was on the cusp of its first drought in more than a decade.   \u003c/p\u003e\n\u003cp\u003e\u0026quot;The rainfall and snowfall have been steady and gradual, it\u0026#39;s not like the floodgates opened up,\u0026quot; said Larry Hajna, a spokesman for the DEP. \u0026quot;This is a good way of pulling out of a drought watch situation.\u0026quot;  \u003c/p\u003e\n\u003cp\u003eThe counties affected are Bergen, Essex, Hudson, Hunterdon, Mercer, Middlesex, Monmouth, Morris, Ocean, Passaic, Somerset and Union. No portion of the state remains under a drought watch. \u003c/p\u003e\n\u003cp\u003eHajna said the DEP still encourages state residents to conserve water wherever possible, but the lifting of the drought watch indicates there is no imminent danger of water shortages as the state heads toward the spring and summer.\u003c/p\u003e\n\u003cp\u003eThe state issued the watch in September, weeks after an NJ Advance Media investigation showed \u003ca href\u003d\"http://www.nj.com/weather/index.ssf/2015/09/nj_dep_published_faulty_drought_data.html\"\u003eit had been publishing faulty rainfall data. \u003c/a\u003e\u003c/p\u003e\n\u003cem\u003eStephen Stirling may be reached at \u003ca href\u003d\"mailto:sstirling@njadvancemedia.com\"\u003esstirling@njadvancemedia.com\u003c/a\u003e. Follow him on Twitter \u003ca href\u003d\"http://www.twitter.com/sstirling\"\u003e@sstirling\u003c/a\u003e. Find \u003ca href\u003d\"https://www.facebook.com/StephenDStirling\"\u003ehim on Facebook\u003c/a\u003e.\u003c/em\u003e","categories":[]},{"title":"Piscataway man charged with drugs, gun possession","link":"http://www.nj.com/middlesex/index.ssf/2016/03/east_brunswick_cops_arrest_man_for_having_drugs_an.html","author":"\u0026lt;span class\u003d\u0026quot;author vcard\u0026quot;\u0026gt;\u0026lt;a class\u003d\u0026quot;bl\u0026quot; id\u003d\u0026quot;name_author\u0026quot; href\u003d\u0026quot;http://connect.nj.com/user/sepstein/posts.html\u0026quot;\u0026gt;\n\t\n\t\t\n\t\n\t\n\t\n\t\n\tSue Epstein | NJ Advance Media for NJ.com\n\u0026lt;/a\u0026gt;\u0026lt;/span\u0026gt;","publishedDate":"Tue, 01 Mar 2016 12:44:30 -0800","contentSnippet":"\n\t\t\t\t\t\t\tA Piscataway man was arrested in East Brunswick after police found a handgun and drugs on him when they stopped a ...","content":"\u003cp\u003e\n\t\t\t\t\t\t\tA Piscataway man was arrested in East Brunswick after police found a handgun and drugs on him when they stopped a car.\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\u003cspan\u003e\u003ca href\u003d\"http://www.nj.com/middlesex/index.ssf/2016/03/east_brunswick_cops_arrest_man_for_having_drugs_an.html\"\u003eWatch video\u003c/a\u003e\u003c/span\u003e\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\t\u003cdiv\u003e\u003cspan\u003e\u003ca href\u003d\"http://media.nj.com/middlesex_impact/photo/18010960-smalljpg-5ae360a6c42592eb.jpg\"\u003e\u003cimg src\u003d\"/static/common/img/blank.gif\" alt\u003d\"18010960-small.jpg\"\u003e\u003c/a\u003e\u003cspan\u003e\u003cspan\u003eA Piscataway man is facing weapons and drug charges after he was arrested in East Brunswick early Saturday morning. \u003c/span\u003e\u003cspan\u003eFile photo\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e \u003c/div\u003e\n\u003cp\u003e\u003ca href\u003d\"javascript:void(0);\"\u003eEAST BRUNSWICK\u003c/a\u003e -- A Piscataway man is in the Middlesex County jail, facing drug and weapons charges after police found a handgun and marijuana on him when they stopped a car on Route 18 in East Brunswick.\u003c/p\u003e\n\u003cp\u003ePolice said Herbert Donerson, 22, was a passenger in a car that Patrolman Christian Longhitano stopped at 1:30 a.m. Saturday on a motor vehicle violation on Route 18 north by the N.J. Turnpike entrance.\u003c/p\u003e\n\u003cp\u003eWhile he was talking to the driver, Longhitano smelled marijuana coming from the car and asked the driver to get out of the vehicle, police said. The driver was searched, but nothing was found, authorities said.\u003c/p\u003e\n\u003cp\u003ePolice said the passenger, later identified as Donerson, was asked to leave the car and as the patrolman began to search him, Donerson \"became uncooperative and agitated,\" according to a statement released by the police.\u003c/p\u003e\n\u003cp\u003e\u003ca href\u003d\"http://www.nj.com/middlesex/index.ssf/2016/03/delays_linger_after_person_killed_by_nj_transit_tr.html\"\u003ehttp://www.nj.com/middlesex/index.ssf/2016/03/delays_linger_after_person_killed_by_nj_transit_tr.html\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePolice said Patrolman Matthew Egnasko, who came to backup Longhitano, helped arrest Donerson and when they searched him, they found a loaded 9mm handgun in his jacket pocket and a bag of marijuana in his front jeans pocket.\u003c/p\u003e\n\u003cp\u003eDonerson is charged with unlawful possession of a weapon and possession of under 50 grams of marijuana. He is in the county jail in lieu of $70,000 bail.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eSue Epstein may be reached at \u003ca href\u003d\"mailto:sepstein@njadvancemedia.com\"\u003esepstein@njadvancemedia.com\u003c/a\u003e. Follow her on Twitter \u003ca href\u003d\"http://www.twitter.com/susan_epstein\"\u003e@susan_epstein\u003c/a\u003e. Find \u003ca href\u003d\"https://www.facebook.com/NJ.com\"\u003eNJ.com on Facebook\u003c/a\u003e.\u003c/em\u003e\u003c/p\u003e","categories":["@crime","@news","east-brunswick","piscataway"]},{"title":"Muslim scholar at N.J. talk: ISIS 'hijacked the religion' of Islam","link":"http://www.nj.com/middlesex/index.ssf/2016/03/muslim_scholar_seeks_to_dispel_myths_about_islam.html","author":"\u0026lt;span class\u003d\u0026quot;author vcard\u0026quot;\u0026gt;\u0026lt;a class\u003d\u0026quot;bl\u0026quot; id\u003d\u0026quot;name_author\u0026quot; href\u003d\u0026quot;http://connect.nj.com/staff/miati/posts.html\u0026quot;\u0026gt;\n\t\n\t\t\n\t\n\t\n\t\n\t\n\tMarisa Iati | NJ Advance Media for NJ.com\n\u0026lt;/a\u0026gt;\u0026lt;/span\u0026gt;","publishedDate":"Tue, 01 Mar 2016 12:30:00 -0800","contentSnippet":"\n\t\t\t\t\t\t\tSuzy Ismail spoke to a crowd in South Brunswick this week about misconceptions about the Islamic ...","content":"\u003cp\u003e\n\t\t\t\t\t\t\tSuzy Ismail spoke to a crowd in South Brunswick this week about misconceptions about the Islamic faith.\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\t\u003cp\u003e\u003ca href\u003d\"http://www.nj.com/middlesex\"\u003eSOUTH BRUNSWICK\u003c/a\u003e -- Suzy Ismail stood before a crowd Sunday, tasked with explaining her faith in a time of great anxiety about it.\u003c/p\u003e\n\u003cp\u003eIsmail, a Muslim scholar, traverses the East Coast to educate people about Islam as worry about both radical Islamic terrorism and Islamophobia continues to \u003ca href\u003d\"http://www.nj.com/essex/index.ssf/2016/02/as_presidential_race_kicks_off_newark_religious_le.html\"\u003esend the country reeling\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eOne of the first things to know about Islam, Ismail told about 50 listeners at the South Brunswick Public Library, is that the Islamic State is not it.\u003c/p\u003e\n\u003cp\u003e\"ISIS, in using the term 'Islamic' in its name, has completely hijacked the religion,\" she said, using an acronym to refer to the terrorist group that now controls large swaths of Iraq and Syria.\u003c/p\u003e\n\u003cp\u003eAs ISIS commits atrocities that directly contradict the guiding principles of Islam, it also spreads misguided fears about Muslims, Ismail said. \u003c/p\u003e\n\u003cp\u003e\"ISIS is not Islam,\" she said. \"The actions of those who commit them under the banner of ISIS have nothing to do with our faith.\"\u003c/p\u003e\n\u003cp\u003e\u003ca href\u003d\"http://www.nj.com/essex/index.ssf/2016/02/as_presidential_race_kicks_off_newark_religious_le.html\"\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eTo Ismail, Islam is a way of life that challenges her to remain focused on her relationship with a God she says is loving and merciful. She said that faith is integral to her personality and manifests itself in all of her actions.\u003c/p\u003e\n\u003cp\u003e\"It comes in serving those in need. It comes in smiling at someone, even when they frown in your face,\" Ismail said. \"That is how we worship our God.\"\u003c/p\u003e\n\u003cp\u003eIsmail then sought to explain Islamic terms she said public figures often misuse.\u003c/p\u003e\n\u003cp\u003e\"Sharia law,\" she said, is thrown around as a dirty word but is comparable to canonical law in Catholicism or Talmudic law in Judaism.\u003c/p\u003e\n\u003cp\u003eIsmail said sharia law is divided into three segments: the very personal, the individual and the public. She said it explains Islamic guidelines on prayer, fasting and charity, and it governs matters of marriage, birth and inheritance.\u003c/p\u003e\n\u003cp\u003eThe first contingency of the public section of sharia law is that a Muslim must follow the law of the country he lives in. So any public element of sharia law is completely inapplicable to the United States, because American law prevails, Ismail said.\u003c/p\u003e\n\u003cp\u003e\u0026quot;Every faith has their set of laws that are based upon the religion, but they\u0026#39;re not laws that change the laws of the land.\u0026quot; she said. \u0026quot;They\u0026#39;re laws that help guide people to better understand their faith.\u0026quot;\u003c/p\u003e\n\u003cp\u003eContemporary Islamophobia is bolstered by the human tendency to seek \u0026quot;boogeymen,\u0026quot; Ismail said, pointing to the \u003ca href\u003d\"https://www.ushmm.org/wlc/en/article.php?ModuleId\u003d10005143\"\u003egenocide of Jews\u003c/a\u003e in the Holocaust and \u003ca href\u003d\"http://www.politico.com/magazine/story/2015/09/pope-francis-visit-catholic-history-213177\"\u003eanimus toward Catholics\u003c/a\u003e in the 19th century United States.\u003c/p\u003e\n\u003cp\u003e\"We say that we are much more tolerant, we are much more open,\" Ismail said. \"But the reality is that history repeats itself, and fear is a powerful driver.\"\u003c/p\u003e\n\u003cp\u003eThe media, she said, promotes this fear by rarely reporting instances of Muslims denouncing violence.\u003c/p\u003e\n\u003cp\u003e\u0026quot;That doesn\u0026#39;t make for good TV,\u0026quot; Ismail said. \u0026quot;So unfortunately, until we get into the media, until we become active participants in the process, we\u0026#39;re going to consistently be subjected to what\u0026#39;s more sensational.\u0026quot;\u003c/p\u003e\n\u003cp\u003e\u003ca href\u003d\"http://www.nj.com/middlesex\"\u003eMORE MIDDLESEX COUNTY NEWS\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eMarisa Iati may be reached at \u003ca href\u003d\"mailto:miati@njadvancemedia.com\"\u003emiati@njadvancemedia.com\u003c/a\u003e. Follow her on Twitter \u003ca href\u003d\"https://twitter.com/marisa_iati\"\u003e@Marisa_Iati\u003c/a\u003e. Find \u003ca href\u003d\"https://www.facebook.com/NJ.com\"\u003eNJ.com on Facebook\u003c/a\u003e.\u003c/em\u003e\u003c/p\u003e","categories":[]},{"title":"N.J. pet store owner charged with 267 counts of animal cruelty","link":"http://www.nj.com/middlesex/index.ssf/2016/03/nj_pet_store_owner_charged_with_267_counts_of_animal_cruelty.html","author":"\u0026lt;span class\u003d\u0026quot;author vcard\u0026quot;\u0026gt;\u0026lt;a class\u003d\u0026quot;bl\u0026quot; id\u003d\u0026quot;name_author\u0026quot; href\u003d\u0026quot;http://connect.nj.com/staff/JeffGoldman/posts.html\u0026quot;\u0026gt;\n\t\n\t\t\n\t\n\t\n\t\n\t\n\tJeff Goldman | NJ Advance Media for NJ.com\n\u0026lt;/a\u0026gt;\u0026lt;/span\u0026gt;","publishedDate":"Tue, 01 Mar 2016 11:23:00 -0800","contentSnippet":"\n\t\t\t\t\t\t\tNJPSCA officials said they also found three dead dogs in freezers in the store\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\tEAST ...","content":"\u003cp\u003e\n\t\t\t\t\t\t\tNJPSCA officials said they also found three dead dogs in freezers in the store\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\t\u003cp\u003e\u003ca href\u003d\"http://www.nj.com/middlesex\"\u003eEAST BRUNSWICK\u003c/a\u003e -- The owner of an East Brunswick pet store has been charged with 267 counts of animal cruelty.\u003c/p\u003e\n\u003cp\u003eJust Pups allowed healthy animals to be kept near sick ones, exposing them to giardia, distemper, upper respiratory infections and other infectious diseases, according to the New Jersey Society for the Prevention of Cruelty to Animals.\u003c/p\u003e\n\u003cdiv\u003e\u003cspan\u003e\u003ca href\u003d\"http://media.nj.com/middlesex_impact/photo/screen-shot-2016-03-01-at-23010-pmpng-2f17340d2da74b35.png\"\u003e\u003cimg src\u003d\"/static/common/img/blank.gif\" alt\u003d\"Screen Shot 2016-03-01 at 2.30.10 PM.png\"\u003e\u003c/a\u003e\u003cspan\u003e\u003cspan\u003eJust Pups in East Brunswick. The owner was charged with 267 counts of animal cruelty. \u003c/span\u003e\u003cspan\u003eGoogle Maps\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e \u003c/div\u003e\n\u003cp\u003eNJPSCA officials said they found three dead dogs in freezers in the store and learned other animals bought in the store on Route 18 were found to be sick and shouldn\u0026#39;t have been sold.\u003c/p\u003e\n\u003cp\u003eForty separate summonses were issued to Vincent LoSacco, who owns Just Pups and three other pet shops in the state. He faces up to $100,000 in fines and is likely to face additional charges, the NJSPCA said.\u003c/p\u003e\n\u003cp\u003eThe NJSPCA also obtained a temporary restraining order from Judge Robyn K. Brown that bars the store from re-opening to the public. The store has been temporarily closed four times since officials began investigating it on Jan. 22.\u003c/p\u003e\n\u003cp\u003e\u003ca href\u003d\"http://www.nj.com/business/index.ssf/2014/10/bamboozled_one_very_sick_puppy_leads_to_big_vet_bills_but_who_should_pay.html\"\u003eSick puppy leads to big vet bills\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eJust Pups posted a message on a social media account last week that said \u003ca href\u003d\"https://www.facebook.com/JustPups.EastBrunswick/?fref\u003dts\"\u003eit has been \"under attack by animal activist extremists who hate all puppy stores\u003c/a\u003e. They have been making baseless, false, and misleading statements regarding our store and the care we give our puppies.\"\u003c/p\u003e\n\u003cp\u003eLoSacco, 50, is due in municipal court in East Brunswick on Monday morning.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eJeff Goldman may be reached at \u003ca href\u003d\"mailto:jeff_goldman@njadvancemedia.com\"\u003ejeff_goldman@njadvancemedia.com\u003c/a\u003e. Follow him on Twitter \u003ca href\u003d\"https://twitter.com/jeffsgoldman\"\u003e@JeffSGoldman\u003c/a\u003e. Find \u003ca href\u003d\"https://www.facebook.com/NJ.com\"\u003eNJ.com on Facebook\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e","categories":["@news","@river","animal-news","east-brunswick"]},{"title":"PHOTOS: Firefighters' cooking competition raises money for St. Barnabas","link":"http://www.nj.com/middlesex/index.ssf/2016/03/photos_firefighters_cook_for_st_barnabas.html","author":"\u0026lt;span class\u003d\u0026quot;author vcard\u0026quot;\u0026gt;\u0026lt;a class\u003d\u0026quot;bl\u0026quot; id\u003d\u0026quot;name_author\u0026quot; href\u003d\u0026quot;http://connect.nj.com/staff/njamstaff/posts.html\u0026quot;\u0026gt;\n\t\n\t\t\n\t\n\t\n\t\n\t\n\tStaff | NJ Advance Media for NJ.com\n\u0026lt;/a\u0026gt;\u0026lt;/span\u0026gt;","publishedDate":"Tue, 01 Mar 2016 10:10:00 -0800","contentSnippet":"\n\t\t\t\t\t\t\tMoney went to the state\u0026apos;s only intensive care burn unit. \n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\tEDISON\u0026nbsp;-- ...","content":"\u003cp\u003e\n\t\t\t\t\t\t\tMoney went to the state\u0026#39;s only intensive care burn unit. \n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\t\u003cp\u003e\u003ca href\u003d\"http://nj.com/middlesex\"\u003eEDISON\u003c/a\u003e -- Firefighters from around the state of New Jersey cooked food Monday to help raise money for the St. Barnabas Medical Center in Livingston.\u003c/p\u003e\n\u003cp\u003eIn the past five years, the event has raised $107,000 for the state's only intensive care burn unit.\u003c/p\u003e\n\u003cp\u003e\"The communities that are important to us are the firefighters, the EMS and the police,\" said Stephen P. Zieniewicz, the president and CEO of the hospital. \"We all work together.\"\u003c/p\u003e\n\u003cp\u003eThe event, at the Pines Manor in Edison, was hosted by the New Jersey State Firefighters Mutual Benevolent Association.People paid $60 to $65 to attend and eat food cooked by firefighters and also by local restaurants.\u003c/p\u003e\n\u003cp\u003eTwenty fire departments competed in three categories.\u003c/p\u003e\n\u003cp\u003eThe winners were:\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePeople's Choice:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eBayonne Fire Department Local 11\n\u003cp\u003ePete Aiello\u003c/p\u003e\n\u003cp\u003eDave Sisk\u003c/p\u003e\n\u003cp\u003eJimmy Lonnay\u003c/p\u003e\n\u003cp\u003eBrian McMonagle\u003c/p\u003e\n\u003cp\u003eHanger Steak with a Cognac Mushroom Sauce and Gorgonzola Smashed Potatoes\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eFirehouse Winner:\u003c/strong\u003e \u003c/p\u003e\n\u003cp\u003ePaterson Fire Department Local 2\u003c/p\u003e\n\u003cp\u003eJason Macones\u003c/p\u003e\n\u003cp\u003eKen Jeltema\u003c/p\u003e\n\u003cp\u003eSean Duffy\u003c/p\u003e\n\u003cp\u003eMike Payne\u003c/p\u003e\n\u003cp\u003eMike Oates\u003c/p\u003e\n\u003cp\u003ePork Belly Tacos With Jalapeno and Pineapple Salsa\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eGourmet Winner:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eRoselle Fire Department Local 55\u003c/p\u003e\n\u003cp\u003eDavid Sheekey\u003c/p\u003e\n\u003cp\u003eChristopher Laba\u003c/p\u003e\n\u003cp\u003eClaudio Ramirez\u003c/p\u003e\n\u003cp\u003eRick Myers\u003c/p\u003e\n\u003cp\u003eShrimp Ceviche In a Soft Flour Tortilla With a Napa Cabbage Slaw\u003c/p\u003e\u003c/p\u003e","categories":[]},{"title":"N.J. man forged checks, stole credit cards and checks from mail: police","link":"http://www.nj.com/hudson/index.ssf/2016/03/no_bail_for_nj_man_charged_with_stealing_credit_ca.html","author":"\u0026lt;span class\u003d\u0026quot;author vcard\u0026quot;\u0026gt;\u0026lt;a class\u003d\u0026quot;bl\u0026quot; id\u003d\u0026quot;name_author\u0026quot; href\u003d\u0026quot;http://connect.nj.com/user/CaitlinMota/posts.html\u0026quot;\u0026gt;\n\t\n\t\t\n\t\n\t\n\t\n\t\n\tCaitlin Mota | The Jersey Journal\n\u0026lt;/a\u0026gt;\u0026lt;/span\u0026gt;","publishedDate":"Tue, 01 Mar 2016 09:42:21 -0800","contentSnippet":"\n\t\t\t\t\t\t\tA Monroe man is being held without bail after he stole credit cards and checks from four different people, according to ...","content":"\u003cp\u003e\n\t\t\t\t\t\t\tA Monroe man is being held without bail after he stole credit cards and checks from four different people, according to a criminal complaint.\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\t\u003cp\u003e\u003ca href\u003d\"https://nj.com/hudson\"\u003eJERSEY CITY\u003c/a\u003e -- A Monroe man is being held without bail after he stole credit cards and checks from four different people, according to a criminal complaint. \u003c/p\u003e\n\u003cp\u003eLawrence D\u0026#39;Amico, 32, appeared in Central Judicial Processing court yesterday on eight counts related to theft and forgery. \u003c/p\u003e\n\u003cp\u003eThe four alleged victims are Jersey City residents. \u003c/p\u003e\n\u003cp\u003eAccording to the complaint, D\u0026#39;Amico forged two checks -- one for $2,700 and another for $980 -- in a Bergen Avenue woman\u0026#39;s name. He also is charged with stealing a debit card from her mailbox. \u003c/p\u003e\n\u003cp\u003eD\u0026#39;Amico is additionally charged with stealing checks from three other mailboxes -- two on Spruce Street homes and the third from a Kennedy Boulevard address -- the complaint stated. \u003c/p\u003e\n\u003cp\u003eDuring his arrest, police found D\u0026#39;Amico in possession of the checks stolen from the two Spruce Street addresses, according to the complaint.  \u003c/p\u003e\n\u003cp\u003eHe is charged with two counts of forgery, four counts of theft and two counts of receiving stolen property. \u003c/p\u003e\n\u003cp\u003eJudge Margaret Marley said a Superior Court judge would set bail for D\u0026#39;Amico later in the day. According to jail records this morning, D\u0026#39;Amico was being held on a no-bail status. \u003c/p\u003e\n\u003cp\u003e\u003cem\u003eCaitlin Mota may be reached at \u003ca href\u003d\"http://mailto:cmota@jjournal.com/\"\u003ecmota@jjournal.com\u003c/a\u003e\u003c/em\u003e\u003cem\u003e. Follow her on Twitter \u003c/em\u003e\u003ca href\u003d\"https://twitter.com/caitlin_mota\"\u003e\u003cem\u003e@caitlin_mota\u003c/em\u003e\u003c/a\u003e\u003cem\u003e. Find \u003c/em\u003e\u003ca href\u003d\"https://www.facebook.com/JerseyJournal?cmpid\u003dJJFacebook\"\u003e\u003cem\u003eThe Jersey Journal on Facebook.\u003c/em\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cdiv\u003e\u003cspan title\u003d\"slideshow\"\u003e\u003cimg src\u003d\"http://media.nj.com/jersey-journal/photo/2016/02/15/19754814-large.jpg\" height\u003d\"253\" width\u003d\"380\" border\u003d\"1\" alt\u003d\"Gallery preview\"\u003e\u003c/span\u003e \u003c/div\u003e","categories":["@crime","@middlesex-county","@news","jersey-city","monroe"]},{"title":"Amtrak worker struck and killed by train","link":"http://www.nj.com/middlesex/index.ssf/2016/03/delays_linger_after_person_killed_by_nj_transit_tr.html","author":"\u0026lt;span class\u003d\u0026quot;author vcard\u0026quot;\u0026gt;\u0026lt;a class\u003d\u0026quot;bl\u0026quot; id\u003d\u0026quot;name_author\u0026quot; href\u003d\u0026quot;http://connect.nj.com/staff/kenthiggs/posts.html\u0026quot;\u0026gt;\n\t\n\t\t\n\t\n\t\n\t\n\t\n\tSpencer Kent and Larry Higgs | NJ Advance Media for NJ.com\n\u0026lt;/a\u0026gt;\u0026lt;/span\u0026gt;","publishedDate":"Tue, 01 Mar 2016 08:59:14 -0800","contentSnippet":"\n\t\t\t\t\t\t\tDelays remain after a person was struck and killed by an NJ Transit train early Tuesday ...","content":"\u003cp\u003e\n\t\t\t\t\t\t\tDelays remain after a person was struck and killed by an NJ Transit train early Tuesday morning.\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\t\u003cp\u003e\u003ca href\u003d\"http://www.nj.com/middlesex/\"\u003eNORTH BRUNSWICK TWP.\u003c/a\u003e -- NJ Transit NEC trains are back or close to running on schedule after an Amtrak employee was \u003ca href\u003d\"http://www.nj.com/news/index.ssf/2016/03/nj_transit_trains_facing_up_to_60_minute_delays.html#incart_river_mobileshort_home\"\u003estruck and killed by an NJ Transit train\u003c/a\u003e early Tuesday morning, a spokesman for Amtrak said.\u003c/p\u003e\n\u003cp\u003eThe worker for the federal train agency was struck around 4:45 a.m. not far from the Jersey Avenue station in New Brunswick, according to Craig Schulz, a spokesman for Amtrak, which is leading the investigation because the incident happened on the company's tracks.\u003c/p\u003e\n\u003cp\u003eNo further information on the employee was available, pending notification of the family, officials said.\u003c/p\u003e\n\u003cp\u003e\u0026quot;There were no injuries to any passengers or crew aboard the train,\u0026quot; Schulz later added in an email.\u003c/p\u003e\n\u003cp\u003eThe circumstances of the death are not known at this time, but the matter remains under investigation.\u003c/p\u003e\n\u003cp\u003e\u003ca href\u003d\"http://www.nj.com/news/index.ssf/2016/03/nj_transit_trains_facing_up_to_60_minute_delays.html#incart_river_mobileshort_home\"\u003eLong delays for rail riders after death\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eFollowing the fatality, service had been briefly suspended between Trenton and Princeton Junction with heavy delays of up to 70 minutes at Service between Trenton and Metropark, previous reports said.\u003c/p\u003e\n\u003cp\u003e\u0026quot;Northeast Corridor passengers traveling between Philadelphia and New York experienced delays of up to an hour earlier this morning, but trains are not on or close to schedule,\u0026quot; Schulz noted in his email.\u003c/p\u003e\n\u003cp\u003eAround 9:30 a.m, there were several NJ Transit police vehicles posted alongside the tracks with officials walking the area where the person was struck and killed, officials said.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eStaff Writer \u003ca href\u003d\"http://connect.nj.com/staff/lhiggs@njadvancemedia.com/posts.html\"\u003eLarry Higgs\u003c/a\u003e contributed to this report.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eSpencer Kent may be reached at \u003ca href\u003d\"mailto:skent@njadvancemedia.com\"\u003eskent@njadvancemedia.com\u003c/a\u003e. Follow him on Twitter \u003ca href\u003d\"http://twitter.com/spencermkent\"\u003e@SpencerMKent\u003c/a\u003e. Find the \u003ca href\u003d\"https://www.facebook.com/NJ.com\"\u003eFind NJ.com on Facebook\u003c/a\u003e.\u003c/em\u003e\u003c/p\u003e","categories":["@mercer-county","@news","@producers-test","@river","@top6-newsletter","@transit","amtrak","nj-transit"]},{"title":"Commuters facing long delays after person killed by NJ Transit train","link":"http://www.nj.com/news/index.ssf/2016/03/nj_transit_trains_facing_up_to_60_minute_delays.html","author":"\u0026lt;span class\u003d\u0026quot;author vcard\u0026quot;\u0026gt;\u0026lt;a class\u003d\u0026quot;bl\u0026quot; id\u003d\u0026quot;name_author\u0026quot; href\u003d\u0026quot;http://connect.nj.com/staff/JeffGoldman/posts.html\u0026quot;\u0026gt;\n\t\n\t\t\n\t\n\t\n\t\n\t\n\tJeff Goldman | NJ Advance Media for NJ.com\n\u0026lt;/a\u0026gt;\u0026lt;/span\u0026gt;","publishedDate":"Tue, 01 Mar 2016 03:45:00 -0800","contentSnippet":"\n\t\t\t\t\t\t\tPerson was struck by a train near Jersey Avenue station in New Brunswick\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\tUPDATE: Man ...","content":"\u003cp\u003e\n\t\t\t\t\t\t\tPerson was struck by a train near Jersey Avenue station in New Brunswick\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\t\u003cp\u003e\u003cstrong\u003eUPDATE: \u003ca href\u003d\"http://www.nj.com/middlesex/index.ssf/2016/03/delays_linger_after_person_killed_by_nj_transit_tr.html\"\u003eMan struck and killed by train identified as Amtrak employee\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eMany \u003ca href\u003d\"http://www.njtransit.com/hp/hp_servlet.srv?hdnPageAction\u003dHomePageTo\"\u003eNJ Transit \u003c/a\u003ecommuters on the Northeast Corridor line should either leave very early or prepare to be late to work.\u003c/p\u003e\n\u003cp\u003eService between Trenton and Metropark is delayed by up to 70 minutes for what NJ Transit described as a trespasser fatality. The person was hit by a train in North Brunswick, not far from the Jersey Avenue station in New Brunswick.\u003c/p\u003e\n\u003cp\u003eService was briefly suspended between Trenton and Princeton Junction before it resumed around 6:25 a.m. with major delays, NJ Transit said on its Twitter feed.\u003c/p\u003e\n\u003cp\u003eOther lines are running on or close to schedule. Commuters' problems could soon get much worse as \u003ca href\u003d\"http://www.nj.com/traffic/index.ssf/2016/02/possible_nj_transit_strike_nears_33_years_after_last_one.html\"\u003erail workers might strike on March 13\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eNJ Advance Media reporter Spencer Kent contributed to this report.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eJeff Goldman may be reached at \u003ca href\u003d\"mailto:jeff_goldman@njadvancemedia.com\"\u003ejeff_goldman@njadvancemedia.com\u003c/a\u003e. Follow him on Twitter \u003ca href\u003d\"https://twitter.com/jeffsgoldman\"\u003e@JeffSGoldman\u003c/a\u003e. Find \u003ca href\u003d\"https://www.facebook.com/NJ.com\"\u003eNJ.com on Facebook\u003c/a\u003e. \u003c/em\u003e\u003c/p\u003e\n\u003cdiv\u003e \u003c/div\u003e","categories":["@exclude","@mercer-county","@middlesex-county","@producers-test","new-brunswick","new-york-city","nj-transit","trenton"]},{"title":"'The Voice' 2016 premiere recap: Alisan Porter slays, but so does N.J. singer","link":"http://www.nj.com/entertainment/tv/index.ssf/2016/02/the_voice_recap_alisan_porter_curly_sue_mike_schia.html","author":"\u0026lt;span class\u003d\u0026quot;author vcard\u0026quot;\u0026gt;\u0026lt;a class\u003d\u0026quot;bl\u0026quot; id\u003d\u0026quot;name_author\u0026quot; href\u003d\u0026quot;http://connect.nj.com/staff/vihyman/posts.html\u0026quot;\u0026gt;\n\t\n\t\t\n\t\n\t\n\t\n\t\n\tVicki Hyman | NJ Advance Media for NJ.com\n\u0026lt;/a\u0026gt;\u0026lt;/span\u0026gt;","publishedDate":"Mon, 29 Feb 2016 20:15:00 -0800","contentSnippet":"\n\t\t\t\t\t\t\tThe \u0026apos;Curly Sue\u0026apos; star earned a four-chair turnaround, but two singers from New Jersey — an acoustic pop-rocker ...","content":"\u003cp\u003e\n\t\t\t\t\t\t\tThe \u0026#39;Curly Sue\u0026#39; star earned a four-chair turnaround, but two singers from New Jersey — an acoustic pop-rocker from Colonia and a rockabilly singer from Bayville — also make it through\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\t\u003cp\u003e\u003ca href\u003d\"http://topics.nj.com/tag/the-voice/\"\u003e\"The Voice\"\u003c/a\u003e judges are always prone to hyperbole, but in the closing moments of \u003ca href\u003d\"http://www.nj.com/entertainment/index.ssf/2016/02/the_voice_season_10_house_of_cards_seaoson_4_tv_th.html\"\u003ethe 10th season premiere\u003c/a\u003e, this paean to \u003ca href\u003d\"http://www.nj.com/entertainment/tv/index.ssf/2016/02/the_voice_2016_who_is_alisan_porter_what_did_curly.html#incart_river_index_topics\"\u003eformer child star Alisan Porter\u003c/a\u003e did not seem misplaced: \u0026quot;The most beautiful, flawless, passionate, pitch-perfect thing I have ever heard in my life,\u0026quot; Adam Levine said of Alisan\u0026#39;s gorgeous rendition of Linda Ronstadt\u0026#39;s \u0026quot;Blue Bayou.\u0026quot; \u003c/p\u003e\n\u003cp\u003eCombined with Alisan's compelling backstory -- \"Star Search,\" followed by roles in \"Parenthood\" and the lead in \"Curly Sue,\" then Broadway and a descent into drugs and alcohol, and finally recovery, marriage and motherhood -- she's already an early favorite.\u003c/p\u003e\n\u003cp\u003eAll four judges turned around for Alisan, who lives in Agoura Hills, Calif., with Adam already convinced she's going to win, and Christina Aguilera praising her \"incredible range and control\" and finding common ground with the singer in motherhood. \"Inside of you, there's so much to say, and people need to hear that hope.\" Alison picked Christina.\u003c/p\u003e\n\u003cdiv\u003e\u003ciframe width\u003d\"640\" height\u003d\"360\" src\u003d\"https://www.youtube.com/embed/wh7lT_xEY_U\" frameborder\u003d\"0\" allowFullScreen\u003d\"\"\u003e\u003c/iframe\u003e\u003c/div\u003e\n\u003cp\u003eAnother singer, acoustic pop-rocker \u003cstrong\u003eMike Schiavo\u003c/strong\u003e from Colonia, performed a smoky version of \u0026quot;Talking Body\u0026quot; by Tove Lo -- and also earned an impromptu duet with Adam on Maroon 5\u0026#39;s \u0026quot;She Will Be Loved.\u0026quot; Schiavo, who moved to Los Angeles last year, got chair turns from Adam, Pharrell Williams and Blake Shelton, but picked Adam. (How could he not?) \u003c/p\u003e\n\u003cdiv\u003e\u003ciframe width\u003d\"640\" height\u003d\"360\" src\u003d\"https://www.youtube.com/embed/q9FhSzctoIs\" frameborder\u003d\"0\" allowFullScreen\u003d\"\"\u003e\u003c/iframe\u003e\u003c/div\u003e\n\u003cp\u003e\u003cstrong\u003eWho else made it through?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe first singer of the night was \u003cstrong\u003ePaxton Ingram\u003c/strong\u003e, a dancer (he performed with Britney Spears and Jennifer Lopez) turned singer from Miami, who sang \u0026quot;Dancing On My Own\u0026quot; by Robyn. With his interesting tone and emotional performance, he piqued the curiosity of Blake, Adam and Pharrell. Blake poured it on thick: \u0026quot;I don\u0026#39;t know if I\u0026#39;ve ever recognized true greatness so quickly.\u0026quot; He picked Blake. \u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMary Sarah\u003c/strong\u003e, a Texas native who now lives in Nashville and sings classic country, really set herself apart with \u0026quot;Where the Boys Are\u0026quot; by Connie Francis, her rich voice fully embodying the vintage style of the song. She earned a four-chair turnaround, but it was no surprise she picked Blake.  \u003c/p\u003e\n\u003cp\u003e\u003ca href\u003d\"http://www.nj.com/entertainment/index.ssf/2016/02/the_voice_season_10_house_of_cards_seaoson_4_tv_th.html\"\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eJersey's\u003cstrong\u003e John Gilman\u003c/strong\u003e, a singer from some alternate backwoods version of Bayville, is another throwback singer who specializes in doo-wop and rockabilly. He sang Elvis\u0026#39;s \u0026quot;Don\u0026#39;t Be Cruel,\u0026quot; which earned difficulty points from Adam, the only judge to turn around. Team Adam it is. \u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eCaity Peters, \u003c/strong\u003ea Long Beach, Calif., worship leader studying to be a teacher, performed \u0026quot;Jealous\u0026quot; by Labrinth. Her stage presence was a bit awkward, but it was a soulful performance that led first Blake and Adam, and then Christina and Pharrell to hit their buzzers. Adam called the performance \u0026quot;heart-wrenchingly beautiful,\u0026quot; but she goes with Pharrell. \u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBryan Bautista\u003c/strong\u003e, a former Barclays Center usher who auditioned last season but didn\u0026#39;t make it through, performed The Weeknd\u0026#39;s \u0026quot;The Hills,\u0026quot; which earned turn-arounds from Christina and Blake. In a moment that will be forever enshrined in Adam\u0026#39;s heart, Bryan seemed to pick Blake -- but it turned out he was just thanking Blake and opted for Christina.\u003c/p\u003e\n\u003cp\u003e\u003ca href\u003d\"http://www.nj.com/entertainment/tv/index.ssf/2015/12/the_voice_2015_winner_jordan_smith_is_deserving_vi.html\"\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbby Celso\u003c/strong\u003e, a barmaid from Rochester, N.Y., who lost her mother to cancer last year, sang Tori Kelly\u0026#39;s \u0026quot;Should\u0026#39;ve Been Us,\u0026quot; and impressed Adam and Pharrell; she picked Pharrell. \u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNick Hagelin\u003c/strong\u003e, a former professional ballet dancer from Atlanta with an adorable son who suffers from a muscular condition that makes it difficult for him to walk, sang Adam\u0026#39;s \u0026quot;Lost Stars.\u0026quot; Christina, Blake and Pharrell all buzzed in, and although Christina compared him to early Michael Jackson and Blake found similarities to Prince, Nick picked \u0026quot;the Quincy Jones of his generation,\u0026quot; Pharrell.\u003c/p\u003e\n\u003cp\u003eWhat did you think of tonight\u0026#39;s first batch? Do you think either of our Jersey contenders can make it all the way to the finale? \u003c/p\u003e\n\u003cp\u003e\u003cem\u003eVicki Hyman may be reached at \u003ca href\u003d\"mailto:vhyman@njadvancemedia.com\"\u003evhyman@njadvancemedia.com\u003c/a\u003e. Follow her on Twitter \u003ca href\u003d\"http://www.twitter.com/vickihy\"\u003e@vickihy\u003c/a\u003e or \u003ca href\u003d\"https://www.facebook.com/Vicki-Hyman-1693875674176221/?ref\u003dhl\"\u003elike her on Facebook\u003c/a\u003e. Find \u003ca href\u003d\"https://www.facebook.com/NJ.comEntertainment\"\u003eNJ.com/Entertainment on Facebook\u003c/a\u003e, and check out TV Hangover, the podcast from Vicki Hyman and co-host Erin Medley on \u003ca href\u003d\"https://itunes.apple.com/us/podcast/tv-hangover/id1035437200?mt\u003d2\"\u003eiTunes\u003c/a\u003e, \u003ca href\u003d\"http://www.stitcher.com/podcast/njdotcom/tv-hangover?refid\u003dstpr\"\u003eStitcher\u003c/a\u003e or listen \u003ca href\u003d\"http://topics.nj.com/tag/tv-hangover/\"\u003ehere\u003c/a\u003e.\u003c/em\u003e \u003c/p\u003e\n\u003chr\u003e\n\u003ch3\u003eTV HANGOVER SHOW: Ep. 23: Is the new 'Fuller House' a show for 'Full House' fans?\u003c/h3\u003e\n\u003cp\u003e\u003csmall\u003e\u003cem\u003e\u003csmall\u003e\u003ca href\u003d\"https://itunes.apple.com/us/podcast/tv-hangover/id1035437200\"\u003eSubscribe to the podcast on iTunes\u003c/a\u003e, \u003ca href\u003d\"javascript:void(0);\"\u003eStitcher\u003c/a\u003e, \u003ca href\u003d\"http://tunein.com/radio/TV-Hangover-p808612/\"\u003eTuneIn\u003c/a\u003e, \u003ca href\u003d\"https://soundcloud.com/nj-com/sets/tv-hangover\"\u003eSoundCloud\u003c/a\u003e or \u003ca href\u003d\"https://www.spreaker.com/show/tv-hangover\"\u003eSpreaker\u003c/a\u003e.\u003c/small\u003e\u003c/em\u003e \u003c/small\u003e\u003c/p\u003e\n\u003chr\u003e","categories":["@entertainment","@middlesex-county","colonia","on-tv","reality-tv","the-voice"]},{"title":"Cops: Reckless bus driver charged in crash that badly injured 2","link":"http://www.nj.com/middlesex/index.ssf/2016/02/bus_driver_charged_with_assault_in_crash_that_hurt.html","author":"\u0026lt;span class\u003d\u0026quot;author vcard\u0026quot;\u0026gt;\u0026lt;a class\u003d\u0026quot;bl\u0026quot; id\u003d\u0026quot;name_author\u0026quot; href\u003d\u0026quot;http://connect.nj.com/staff/brianamaral/posts.html\u0026quot;\u0026gt;\n\t\n\t\t\n\t\n\t\n\t\n\t\n\tBrian Amaral | NJ Advance Media for NJ.com\n\u0026lt;/a\u0026gt;\u0026lt;/span\u0026gt;","publishedDate":"Mon, 29 Feb 2016 12:22:00 -0800","contentSnippet":"\n\t\t\t\t\t\t\tJamal L. Penten was distracted, police said, and failed to take evasive maneuvers. \n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\tSOUTH ...","content":"\u003cp\u003e\n\t\t\t\t\t\t\tJamal L. Penten was distracted, police said, and failed to take evasive maneuvers. \n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\t\u003cp\u003e\u003ca href\u003d\"http://nj.com/middlesex\"\u003eSOUTH BRUNSWICK\u003c/a\u003e -- A Lakewood bus driver was charged criminally Monday after a \u003ca href\u003d\"http://www.nj.com/middlesex/index.ssf/2016/02/bus_crashes_into_cars_injuring_7.html\"\u003ecrash that injured seven people, two of them seriously,\u003c/a\u003e and tied up traffic on Route 130 for hours.\u003c/p\u003e\n\u003cp\u003eJamal L. Penten, 30, surrendered Monday at South Brunswick Police headquarters and was charged with assault by auto.\u003c/p\u003e\n\u003cp\u003ePolice said Penten was driving the bus \"recklessly\" when he hit nine vehicles waiting at a red light by Friendship Road at 6:30 a.m. Thursday. He was going 50 miles an hour, and distracted for 1,000 feet before the collision, police said.\u003c/p\u003e\n\u003cp\u003ePenten did not reduce his speed, brake or take evasive action before hitting the first vehicle at \"full highway speed,\" police said. The bus continued on for another 200 feet after the first collision, police said. The crash left a mangled wreck of cars on the road and blocked off traffic for several hours.\u003c/p\u003e\n\u003cp\u003e\u003ca href\u003d\"http://www.nj.com/middlesex/index.ssf/2016/02/bus_crashes_into_cars_injuring_7.html\"\u003ehttp://www.nj.com/middlesex/index.ssf/2016/02/bus_crashes_into_cars_injuring_7.html\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eSuburban Transit/Coach USA is the bus line operator. No passengers were on board at the time.\u003c/p\u003e\n\u003cp\u003eTwo victims remain at Robert Wood Johnson University Hospital in New Brunswick, police said. A 61-year-old woman from Princeton was hospitalized with a fractured pelvis and ribs while a 35-year-old man from Brick Township has a fractured back.\u003c/p\u003e\n\u003cp\u003e\"This crash only highlights the dangers of distracted driving,\" South Brunswick Police Chief Raymond Hayducka said in a written statement. \"Drivers have a responsibility to focus on their driving. That responsibility was disregarded in this case despite him driving a 50,000 gross weight bus at highway speeds. This crash was easily preventable.\"\u003c/p\u003e\n\u003cp\u003ePolice did not say what Penten was distracted by, but added that for 10 seconds, while going 50 miles an hour in a bus, he was not looking at the road in front of him.\u003c/p\u003e\n\u003cp\u003ePenten posted $2,500 bail and was released, police said. He was also ticketed for reckless driving, following too closely, and obstruction of traffic.\u003c/p\u003e\n\u003cp\u003ePenten had no points or suspensions or accidents associated with any violations on his driving record, according to Mairin Bellack, spokeswoman for the New Jersey Motor Vehicle Commission. He is also listed as having valid driving privileges in the state as well as a commercial driver\u0026#39;s license.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eStaff writer \u003ca href\u003d\"http://connect.nj.com/staff/Skent/posts.html\"\u003eSpencer Kent\u003c/a\u003e contributed to this report.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eBrian Amaral may be reached at \u003ca href\u003d\"mailto:bamaral@njadvancemedia.com\"\u003ebamaral@njadvancemedia.com\u003c/a\u003e. Follow him on Twitter \u003ca href\u003d\"http://twitter.com/bamaral44\"\u003e@bamaral44\u003c/a\u003e. Find \u003ca href\u003d\"https://www.facebook.com/NJ.com\"\u003eNJ.com on Facebook\u003c/a\u003e.\u003c/em\u003e\u003c/p\u003e","categories":["@news","@ocean-county","@river","lakewood","south-brunswick"]},{"title":"N.J. man arraigned on charges he robbed 14 hotels","link":"http://www.nj.com/essex/index.ssf/2016/02/nj_man_arraigned_on_charges_he_robbed_14_hotels.html","author":"\u0026lt;span class\u003d\u0026quot;author vcard\u0026quot;\u0026gt;\u0026lt;a class\u003d\u0026quot;bl\u0026quot; id\u003d\u0026quot;name_author\u0026quot; href\u003d\u0026quot;http://connect.nj.com/staff/tdarragh/posts.html\u0026quot;\u0026gt;\n\t\n\t\t\n\t\n\t\n\t\n\t\n\tTim Darragh | NJ Advance Media for NJ.com\n\u0026lt;/a\u0026gt;\u0026lt;/span\u0026gt;","publishedDate":"Mon, 29 Feb 2016 11:49:58 -0800","contentSnippet":"\n\t\t\t\t\t\t\tTremone Burnett in some cases tied up employees and brandished a gun, authorities charge. ...","content":"\u003cp\u003e\n\t\t\t\t\t\t\tTremone Burnett in some cases tied up employees and brandished a gun, authorities charge. \n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\t\u003cdiv\u003e\u003c/div\u003e\n\u003cp\u003e\u003ca href\u003d\"http://www.nj.com/town\"\u003eNEWARK\u003c/a\u003e -- An Orange man is facing the possibility of spending the rest of his life in prison on charges he allegedly held up workers in hotels in New Jersey and New York over a six-week period in 2014.\u003c/p\u003e\n\u003cp\u003eTremone Burnett was arraigned Monday before U.S. District Judge Katharine S. Hayden \u003ca href\u003d\"http://www.nj.com/essex/index.ssf/2014/09/orange_man_charged_with_robbing_six_north_jersey_hotels_at_gunpoint.html\"\u003eon charges that he held up workers at 14 hotels\u003c/a\u003e from April through June, 2014. \u003c/p\u003e\n\u003cp\u003eBurnett faces \u003ca href\u003d\"https://www.fbi.gov/newark/press-releases/2014/essex-county-man-charged-in-armed-robberies-of-new-jersey-hotels\"\u003echarges for each of the alleged robberies as well as for brandishing a gun\u003c/a\u003e during the crimes, authorities said. If convicted on the robbery and gun charges, he would be required to serve the sentences consecutively, said Assistant U.S. Attorney Barry Kamar. \u003c/p\u003e\n\u003cp\u003e\u0026quot;Effectively, the defendant is looking at life\u0026quot; in prison if convicted, he said. \u003c/p\u003e\n\u003cp\u003eBurnett, who is represented by public defender Chester Keller, did not speak during his appearance. He is pleading not guilty.\u003c/p\u003e\n\u003cp\u003eAccording to court records, Burnett allegedly held up employees at these hotels in 2014: Howard Johnson\u0026#39;s in Newark, April 24; Comfort Suites, Woodbridge, May 7; Marriott Fairfield Suites, Best Western, Rockaway and the Crowne Plaza, Paramus, all May 9; Extended Stay America, Secaucus and the Sheraton, Weehawken, both May 31; Howard Johnson\u0026#39;s Airmont, N.Y. and the Comfort Inn, Edison, both June 4; the Marriott, Lebanon, June 8; the Hilton Garden Inn, Nanuet, N.Y., June 13; the Hotel Executive Suites, Carteret and the Fairfield Inn, Newark, both June 15; and the Comfort Suites, Newark, June 19. \u003c/p\u003e\n\u003cp\u003eIn some cases, Burnett allegedly tied up employees using zip ties. \u003c/p\u003e\n\u003cp\u003eHe also fired a gun during the May 31 robbery in Weehawken, court papers say. \u003c/p\u003e\n\u003cp\u003e\u003ca href\u003d\"http://www.co.hunterdon.nj.us/prosecutor/pressrelease/2014/Sept2-BurnettComplaint.pdf\"\u003eWhen he was first charged in 2014,\u003c/a\u003e authorities accused Burnett of participating in six robberies, in which he made off with $2,850, safety deposit boxes, employee paychecks and an ATM machine. \u003c/p\u003e\n\u003cp\u003e\u003cem\u003eTim Darragh may be reached at \u003ca href\u003d\"mailto:tdarragh@njadvancemedia.com\"\u003etdarragh@njadvancemedia.com\u003c/a\u003e. Follow him on Twitter \u003ca href\u003d\"https://twitter.com/timdarragh\"\u003e@timdarragh\u003c/a\u003e. Find \u003ca href\u003d\"https://www.facebook.com/NJ.com\"\u003eNJ.com on Facebook\u003c/a\u003e.\u003c/em\u003e\u003c/p\u003e","categories":["@bergen-county","@crime","@hudson-county","@middlesex-county","@morris-county","@news","@river","us-attorneys-office-nj"]},{"title":"Accident causes traffic on Route 1 in South Brunswick","link":"http://www.nj.com/middlesex/index.ssf/2016/02/drivers_should_avoid_route_1_in_south_brunswick.html","author":"\u0026lt;span class\u003d\u0026quot;author vcard\u0026quot;\u0026gt;\u0026lt;a class\u003d\u0026quot;bl\u0026quot; id\u003d\u0026quot;name_author\u0026quot; href\u003d\u0026quot;http://connect.nj.com/staff/Skent/posts.html\u0026quot;\u0026gt;\n\t\n\t\t\n\t\n\t\n\t\n\t\n\tSpencer Kent | NJ Advance Media for NJ.com\n\u0026lt;/a\u0026gt;\u0026lt;/span\u0026gt;","publishedDate":"Mon, 29 Feb 2016 10:53:00 -0800","contentSnippet":"\n\t\t\t\t\t\t\tAn accident has caused traffic on Route 1 South in South Brunswick.\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\tNJ Advance ...","content":"\u003cp\u003e\n\t\t\t\t\t\t\tAn accident has caused traffic on Route 1 South in South Brunswick.\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\t\u003cdiv\u003e\u003cspan\u003e\u003ca href\u003d\"http://media.nj.com/middlesex_impact/photo/holiday-traffic-b53467ff7621ee9c.jpg\"\u003e\u003cimg src\u003d\"/static/common/img/blank.gif\" alt\u003d\"HOLIDAY TRAFFIC\"\u003e\u003c/a\u003e\u003cem\u003e\u003cspan\u003e\u003cspan\u003eNJ Advance Media\u003c/span\u003e\u003c/span\u003e\u003c/em\u003e\u003c/span\u003e \u003c/div\u003e\n\u003cp\u003e\u003ca href\u003d\"http://www.nj.com/south-brunswick/\"\u003eSOUTH BRUNSWICK TWP.\u003c/a\u003e -- A motor vehicle accident has caused traffic on Route 1 South.\u003c/p\u003e\n\u003cp\u003eFor the next hour, motorists should avoid the Route 1 South area south of New Road, police said in a statement.\u003c/p\u003e\n\u003cp\u003eOne lane remained open in the area on Route 1 South as of about 1:30 p.m., officials said.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eSpencer Kent may be reached at \u003ca href\u003d\"mailto:skent@njadvancemedia.com\"\u003eskent@njadvancemedia.com\u003c/a\u003e. Follow him on Twitter \u003ca href\u003d\"http://twitter.com/spencermkent\"\u003e@SpencerMKent\u003c/a\u003e. Find the \u003ca href\u003d\"https://www.facebook.com/NJ.com\"\u003eFind NJ.com on Facebook\u003c/a\u003e.\u003c/em\u003e\u003c/p\u003e","categories":["@news","@traffic","south-brunswick"]},{"title":"Traffic stop yields 12 pounds of pot, East Brunswick cops say","link":"http://www.nj.com/middlesex/index.ssf/2016/02/cops_make_traffic_stop_find_12_pounds_of_marijuana.html","author":"\u0026lt;span class\u003d\u0026quot;author vcard\u0026quot;\u0026gt;\u0026lt;a class\u003d\u0026quot;bl\u0026quot; id\u003d\u0026quot;name_author\u0026quot; href\u003d\u0026quot;http://connect.nj.com/user/sepstein/posts.html\u0026quot;\u0026gt;\n\t\n\t\t\n\t\n\t\n\t\n\t\n\tSue Epstein | NJ Advance Media for NJ.com\n\u0026lt;/a\u0026gt;\u0026lt;/span\u0026gt;","publishedDate":"Mon, 29 Feb 2016 09:21:40 -0800","contentSnippet":"\n\t\t\t\t\t\t\tTwo East Brunswick police detectives stopped a man on motor vehicle violations and found 12 pounds of marijuana in his ...","content":"\u003cp\u003e\n\t\t\t\t\t\t\tTwo East Brunswick police detectives stopped a man on motor vehicle violations and found 12 pounds of marijuana in his car.\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\t\u003cdiv\u003e\u003cspan\u003e\u003ca href\u003d\"http://media.nj.com/middlesex_impact/photo/18010960-smalljpg-88c1d6ca51b18bd7.jpg\"\u003e\u003cimg src\u003d\"/static/common/img/blank.gif\" alt\u003d\"18010960-small.jpg\"\u003e\u003c/a\u003e\u003cspan\u003e\u003cspan\u003eEast Brunswick police charge New Brunswick man with having 12 pounds of marijuana in his car. \u003c/span\u003e\u003cspan\u003eFile photo\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e \u003c/div\u003e\n\u003cp\u003e\u003ca href\u003d\"javascript:void(0);\"\u003eEAST BRUNSWICK\u003c/a\u003e -- Police said two detectives from the department's special investigations unit stopped a vehicle on Tices Lane in January for alleged motor vehicle violations and found 12 pounds of marijuana inside.\u003c/p\u003e\n\u003cp\u003eDetectives Dan Unkel and Alex Danese said stopped the vehicle in the area of Harts Lane and after speaking with the driver, Abhishek Mukherjee, conducted a search of the car, police said. They found the marijuana, ketamine, drug paraphernalia and about $1,000 in cash, authorities said.\u003c/p\u003e\n\u003cp\u003eMukherjee, 21, of New Brunswick, was charged with possession of marijuana Over 50 grams), possession of marijuana (over 5 pounds) with the intend to distribute, posession of ketamine, possession of drug paraphernalia and numerous motor vehicle summons\u003c/p\u003e\n\u003cp\u003eHe is in the Middlesex County jail in lieu of $60,000 bail.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eSue Epstein may be reached at \u003ca href\u003d\"mailto:sepstein@njadvancemedia.com\"\u003esepstein@njadvancemedia.com\u003c/a\u003e. Follow her on Twitter \u003ca href\u003d\"http://www.twitter.com/susan_epstein\"\u003e@susan_epstein\u003c/a\u003e. Find \u003ca href\u003d\"https://www.facebook.com/NJ.com\"\u003eNJ.com on Facebook\u003c/a\u003e.\u003c/em\u003e\u003c/p\u003e","categories":["@crime","@news","east-brunswick"]},{"title":"$1M Powerball ticket sold in North Jersey","link":"http://www.nj.com/lottery/index.ssf/2016/02/1m_powerball_ticket_sold_in_parsippany.html","author":"\u0026lt;span class\u003d\u0026quot;author vcard\u0026quot;\u0026gt;\u0026lt;a class\u003d\u0026quot;bl\u0026quot; id\u003d\u0026quot;name_author\u0026quot; href\u003d\u0026quot;http://connect.nj.com/staff/pmilo/posts.html\u0026quot;\u0026gt;\n\t\n\t\t\n\t\n\t\n\t\n\t\n\tPaul Milo | NJ Advance Media for NJ.com\n\u0026lt;/a\u0026gt;\u0026lt;/span\u0026gt;","publishedDate":"Mon, 29 Feb 2016 08:52:14 -0800","contentSnippet":"\n\t\t\t\t\t\t\tPowerball jackpot closes in on $300M after nobody picks the winning numbers on February ...","content":"\u003cp\u003e\n\t\t\t\t\t\t\tPowerball jackpot closes in on $300M after nobody picks the winning numbers on February 27\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\t\u003cp\u003e\u003ca href\u003d\"http://www.nj.com/morris\"\u003ePARSIPPANY\u003c/a\u003e -- One of three million-dollar tickets sold in Saturday\u0026#39;s \u003ca href\u003d\"http://www.powerball.com/pb_home.asp\"\u003ePowerball \u003c/a\u003edrawing was purchased at Lake Parsippany General Store on Kingston Road, state lottery officials said Monday morning. \n\u003cp\u003eThe ticket sold in Morris County over the weekend matched five numbers but not the Powerball. One ticket each was sold in Wisconsin and Texas also good for the million-dollar prize in Saturday\u0026#39;s drawing. \u003c/p\u003e\n\u003cp\u003eThe winning numbers for Saturday\u0026#39;s drawing were \u003cstrong\u003e10, 11, 21, 22\u003c/strong\u003e and \u003cstrong\u003e53\u003c/strong\u003e. The Powerball was \u003cstrong\u003e18\u003c/strong\u003e. The jackpot is expected to be at $292 million by the next drawing Wednesday night. \u003c/p\u003e\n\u003cp\u003e\u003ca href\u003d\"http://www.nj.com/lottery/index.ssf/2016/02/powerball_jackpot_hasnt_been_won_since_record_draw.html\"\u003eNo Powerball winner since $1.6B jackpot \u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eThe Garden State also had a number of other big winners, with three tickets sold matching four white balls and the Powewrball -- good for a $50,000 prize. \u003c/p\u003e\n\u003cp\u003eThose tickets were purchased at Hanh Van LLC, 117 Brunswick St., Jersey City; Street Corner News, 755 Rt. 18 So., East Brunswick;  and, Quick Chek #40, 150 Rt. 206, Chester. \u003c/p\u003e\n\u003cp\u003e\u003cem\u003ePaul Milo may be reached at pmilo@njadvancemedia.com. Follow him on Twitter\u003c/em\u003e\u003ca href\u003d\"https://twitter.com/PaulMilo2\"\u003e\u003cem\u003e@PaulMilo2\u003c/em\u003e\u003c/a\u003e\u003cem\u003e. Find \u003c/em\u003e\u003ca href\u003d\"http://www.nj.com/#/0\"\u003e\u003cem\u003eNJ.com\u003c/em\u003e\u003c/a\u003e \u003cem\u003eon Facebook.\u003c/em\u003e\u003c/p\u003e\n\u003cdiv\u003e \u003c/div\u003e\n\u003cp\u003e\u003cem\u003e \u003c/em\u003e\u003c/p\u003e\u003c/p\u003e","categories":[]}]}}, "responseDetails": null, "responseStatus": 200}